clear all;
clc;
%https://function-x.ru/games_matrix_games.html расчет задачи 6
m = 3; %количество стратегий первого игрока
n = 3; %количество стратегий второго игрока
P = zeros([1 m]);
Q = zeros([1 n]);
f = [1 1 1];
A = [4 2 2; 2 5 0; 0 2 5];
A2 = transpose(A);
b = [1 1 1];
[Z] = linprog(-f, A2, b); %считает оптимальный план для первого игрока
[U, F] = linprog(f, -A, -b); %считает оптимальный план для второго игрока
g = 1/F; %  цена игры;

for i = 1:m
        P(i) = Z(i)*g
end
for i = 1:n
        Q(i) = U(i)*g
end
p1 = 19/35;
p2 = 6/35;
p3 = 2/7;
q1 = 9/35
q2 = 2/5
q3 = 12/35